InformationRegisters/УдалитьНастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдалитьНастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтрольПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтрольВыводИзОборота</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаУведомительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаРазрешительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРозницаЛокальныйРазрешительныйРежим</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОптКонтрольПоштучно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОптКонтрольОСУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапретПродажиНемаркированныхОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрослеживаемостьПеремещенияМеждуМОД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонтроляРазрешительныхДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьНастройкиУчетаМаркируемойПродукцииИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Если ОбновлениеИнформационнойБазыГосИС.ЭтоРежимСервиса() Тогда
		Обработчик = ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
			Обработчики,
			Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП,
			Новый УникальныйИдентификатор("3187d63c-5aa9-4e79-ac1c-942b89382dac"));
		Обработчик.РежимВыполнения                     = "Монопольно";
		Обработчик.Многопоточный                       = Ложь;
		Обработчик.ПроцедураЗаполненияДанныхОбновления = Неопределено;
		Обработчик.ЗапускатьИВПодчиненномУзлеРИБСФильтрами = Ложь;
		ОбновлениеИнформационнойБазыГосИС.ДобавитьЧитаемыйОбъект(Обработчик, Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП);
	КонецЕсли;
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ОбъектМетаданных     = Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП;
	ПолноеИмяОбъекта     = ОбъектМетаданных.ПолноеИмя();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка              = Новый БлокировкаДанных;
		ЭлементБлокировки       = Блокировка.Добавить(ОбъектМетаданных.ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки       = Блокировка.Добавить(Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП.ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ОбработатьНастройкиУчетаМаркируемойПродукцииПриПереходеНаКонструкторНастроек();
		//Строго после включения видов продукции для обработки исключений
		Константы.НастройкиСканированияКодовМаркировкиИСМП.ОбработатьНастройкиСканированияПриПереходеНаКонструкторНастроек();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось обработать ""%1"" при переходе на конструктор настроек видов продукции по причине:
				       |%2'"),
			ПолноеИмяОбъекта,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
КонецПроцедуры

// Обработать настройки учета маркируемой продукции при переходе на конструктор настроек.
Процедура ОбработатьНастройкиУчетаМаркируемойПродукцииПриПереходеНаКонструкторНастроек() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	ИменаДат        = КонструкторИСМПОбщегоНазначенияКлиентСервер.ИменаДатНачалаРаботыСМаркируемойПродукцией(Истина);
	КешКонвертаций  = ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции();
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		
		Если Не СтрокаНабора.ВестиУчетПродукции
			Или Не ЗначениеЗаполнено(СтрокаНабора.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗаписи = АдминистрированиеИСМПКлиентСервер.ПараметрыЗаписиМаркируемойПродукции();
		ПараметрыЗаписи.ЗаписыватьВидПродукции = Истина;
		
		СтрокаДанных = АдминистрированиеИСМПКлиентСервер.СтрокаДанныхЗаписиМаркируемойПродукции();
		СтрокаДанных.ВидПродукции = ОбновлениеИнформационнойБазыИСМП.ВидПродукцииГИСМТПоПеречислению(
			СтрокаНабора.ВидПродукции, КешКонвертаций);
		СтрокаДанных.ВидПродукцииВерхнегоУровня = Истина;
		
		Если Не ЗначениеЗаполнено(СтрокаДанных.ВидПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПроизводства(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаКонтрольПроизводства)
			И СтандартнаяДата <> СтрокаНабора.ДатаКонтрольПроизводства Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаПроизводства] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаПроизводства] = СтрокаНабора.ДатаКонтрольПроизводства;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаВыводаИзОборота(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаКонтрольВыводИзОборота)
			И СтандартнаяДата <> СтрокаНабора.ДатаКонтрольВыводИзОборота  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаВыводаИзОборота] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаВыводаИзОборота] = СтрокаНабора.ДатаКонтрольВыводИзОборота;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаРозничныхПродаж(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаРозницаУведомительныйРежим)
			И СтандартнаяДата <> СтрокаНабора.ДатаРозницаУведомительныйРежим  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаРозничныхПродаж] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаРозничныхПродаж] = СтрокаНабора.ДатаРозницаУведомительныйРежим;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаРазрешительногоРежима(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаРозницаРазрешительныйРежим)
			И СтандартнаяДата <> СтрокаНабора.ДатаРозницаРазрешительныйРежим  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаРазрешительногоРежима] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаРазрешительногоРежима] = СтрокаНабора.ДатаРозницаРазрешительныйРежим;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаИспользованияЛокальногоМодуля(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаРозницаЛокальныйРазрешительныйРежим)
			И СтандартнаяДата <> СтрокаНабора.ДатаРозницаЛокальныйРазрешительныйРежим  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаИспользованияЛокальногоМодуля] = Истина;;
			СтрокаДанных[ИменаДат.ДатаНачалаИспользованияЛокальногоМодуля] = СтрокаНабора.ДатаРозницаЛокальныйРазрешительныйРежим;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаОформленияУПДПоштучно(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаОптКонтрольПоштучно)
			И СтандартнаяДата <> СтрокаНабора.ДатаОптКонтрольПоштучно  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаОформленияУПДПоштучно] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаОформленияУПДПоштучно] = СтрокаНабора.ДатаОптКонтрольПоштучно;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаОформленияУПДОСУ(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаОптКонтрольОСУ)
			И СтандартнаяДата <> СтрокаНабора.ДатаОптКонтрольОСУ  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаОформленияУПДОСУ] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаОформленияУПДОСУ] = СтрокаНабора.ДатаОптКонтрольОСУ;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаЗапретаПродажБезМарок(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаЗапретПродажиНемаркированныхОстатков)
			И СтандартнаяДата <> СтрокаНабора.ДатаЗапретПродажиНемаркированныхОстатков  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаЗапретаПродажБезМарок] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаЗапретаПродажБезМарок] = СтрокаНабора.ДатаЗапретПродажиНемаркированныхОстатков;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПрослеживаемостиПеремещенияМеждуМОД(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаПрослеживаемостьПеремещенияМеждуМОД)
			И СтандартнаяДата <> СтрокаНабора.ДатаПрослеживаемостьПеремещенияМеждуМОД  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаПрослеживаемостиПеремещенияМеждуМОД] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаПрослеживаемостиПеремещенияМеждуМОД] = СтрокаНабора.ДатаПрослеживаемостьПеремещенияМеждуМОД;
		КонецЕсли;
		
		СтандартнаяДата = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаКонтроляРазрешительныхДокументов(СтрокаДанных.ВидПродукции);
		Если ЗначениеЗаполнено(СтрокаНабора.ДатаКонтроляРазрешительныхДокументов)
			И СтандартнаяДата <> СтрокаНабора.ДатаКонтроляРазрешительныхДокументов  Тогда
			ПараметрыЗаписи["Записывать" + ИменаДат.ДатаНачалаКонтроляРазрешительныхДокументов] = Истина;
			СтрокаДанных[ИменаДат.ДатаНачалаКонтроляРазрешительныхДокументов] = СтрокаНабора.ДатаКонтроляРазрешительныхДокументов;
		КонецЕсли;
		
		ПараметрыЗаписи.Данные.Добавить(СтрокаДанных);
		
		РезультатЗаписи = АдминистрированиеИСМП.ЗаписатьДанныеМаркируемойПродукции(ПараметрыЗаписи);
		
		Если ЗначениеЗаполнено(РезультатЗаписи) Тогда
			ВызватьИсключение РезультатЗаписи;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Инициализирует структуру для записи регистра
// 
// Возвращаемое значение:
//  Структура:
// * ВидПродукции                             - Произвольный - Вид продукции
// * ВестиУчетПродукции                       - Произвольный - Истина, если включен учет по виду продукции
// * ДатаКонтрольПроизводства                 - Произвольный - Дата обязательной маркировки, необходимость распечатки кодов и ввода в оборот
// * ДатаКонтрольВыводИзОборота               - Произвольный - Дата начала обязательной маркировки при выводе из оборота по прочим причинам (не являющимся продажей в розницу)
// * ДатаРозницаУведомительныйРежим           - Произвольный - Дата начала действия уведомительного режима
// * ДатаРозницаРазрешительныйРежим           - Произвольный - Дата начала действия разрешительного режима онлайн
// * ДатаРозницаЛокальныйРазрешительныйРежим  - Произвольный - Дата начала действия локального разрешительного режима
// * ДатаОптКонтрольПоштучно                  - Произвольный - Дата начала обязательной маркировки при продаже поштучно
// * ДатаОптКонтрольОСУ                       - Произвольный - Дата начала обязательной маркировки при продаже по ОСУ
// * ДатаЗапретПродажиНемаркированныхОстатков - Произвольный - Дата завершения продажи немаркированных остатков маркируемой продукции
Функция ИнициализироватьНастройкуУчетаМаркируемойПродукцииИСМП() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	КоллекцияРеквизитов = Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП.Измерения;
	Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
		ВозвращаемоеЗначение.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	КоллекцияРеквизитов = Метаданные.РегистрыСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП.Ресурсы;
	Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
		ВозвращаемоеЗначение.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	//@skip-check constructor-function-return-section
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
